Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4ecb/atdf/ATSAM4E8CB.atdf
          <instance name="AFEC1">
            <register-group address-space="base" name="AFEC1" name-in-module="AFEC" offset="0x400B4000"/>
            
          <signals>
              <signal pad="PB2" function="X1" group="AFE1_AD" index="0"/>
              <signal pad="PB2" function="X1" group="WKUP" index="12"/>
              <signal pad="PB3" function="X1" group="AFE1_AD" index="1"/>
              <signal pad="PA21" function="X1" group="AFE1_AD" index="2"/>
              <signal pad="PA22" function="X1" group="AFE1_AD" index="3"/>
              <signal pad="PC1" function="X1" group="AFE1_AD" index="4"/>
              <signal pad="PC2" function="X1" group="AFE1_AD" index="5"/>
              <signal pad="PC3" function="X1" group="AFE1_AD" index="6"/>
              <signal pad="PC4" function="X1" group="AFE1_AD" index="7"/>
            </signals>
          </instance>
        </module>
        <module name="CAN" id="6019" version="P">
          <instance name="CAN0">
            <register-group address-space="base" name="CAN0" name-in-module="CAN" offset="0x40010000"/>
            
          <signals>
              <signal pad="PB3" function="A" group="CANRX" index="0"/>
              <signal pad="PB2" function="A" group="CANTX" index="0"/>
            </signals>
          </instance>
          <instance name="CAN1">
            <register-group address-space="base" name="CAN1" name-in-module="CAN" offset="0x40014000"/>
            
          <signals>
              <signal pad="PC12" function="C" group="CANRX" index="1"/>
              <signal pad="PC15" function="C" group="CANTX" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="S">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0740"/>
          </instance>
        </module>
        <module name="CMCC" id="11108" version="C">
          <instance name="CMCC">
            <register-group address-space="base" name="CMCC" name-in-module="CMCC" offset="0x400C4000"/>
          </instance>
        </module>
        <module name="DACC" id="6461" version="K">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x400B8000"/>
            
          <signals>
              <signal pad="PB13" function="X1" group="DAC" index="0"/>
              <signal pad="PB14" function="X1" group="DAC" index="1"/>
              <signal pad="PA2" function="C" group="DATRG"/>
            </signals>
          </instance>
        </module>
        <module name="DMAC" id="6233" version="P">
          <instance name="DMAC">
            <register-group address-space="base" name="DMAC" name-in-module="DMAC" offset="0x400C0000"/>
          </instance>
        </module>
        <module name="EFC" id="6450" version="N">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0A00"/>
            
          <parameters><param name="FLASH_SIZE" value="524288"/><param name="PAGE_SIZE" value="512"/><param name="PAGES_PR_REGION" value="16"/></parameters></instance>
        </module>
        <module name="GPBR" id="6378" version="F">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1890"/>
          </instance>
        </module>
        <module name="HSMCI" id="6449" version="O">
          <instance name="HSMCI">
            <register-group address-space="base" name="HSMCI" name-in-module="HSMCI" offset="0x40080000"/>
            
          <signals>
              <signal pad="PA28" function="C" group="MCCDA"/>
              <signal pad="PA29" function="C" group="MCCK"/>
              <signal pad="PA30" function="C" group="MCDA" index="0"/>
              <signal pad="PA31" function="C" group="MCDA" index="1"/>
              <signal pad="PA26" function="C" group="MCDA" index="2"/>
              <signal pad="PA27" function="C" group="MCDA" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="MATRIX" id="11227" version="A">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x400E0200"/>
          </instance>
        </module>
        <module name="PIO" id="11004" version="N">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
            
          <signals>
      <signal pad="PA0" function="default" group="P" index="0"/>
      <signal pad="PA1" function="default" group="P" index="1"/>
      <signal pad="PA2" function="default" group="P" index="2"/>
      <signal pad="PA3" function="default" group="P" index="3"/>
      <signal pad="PA4" function="default" group="P" index="4"/>
      <signal pad="PA5" function="default" group="P" index="5"/>
      <signal pad="PA6" function="default" group="P" index="6"/>
      <signal pad="PA7" function="default" group="P" index="7"/>
      <signal pad="PA8" function="default" group="P" index="8"/>
      <signal pad="PA9" function="default" group="P" index="9"/>
      <signal pad="PA10" function="default" group="P" index="10"/>
      <signal pad="PA11" function="default" group="P" index="11"/>
      <signal pad="PA12" function="default" group="P" index="12"/>
      <signal pad="PA13" function="default" group="P" index="13"/>
      <signal pad="PA14" function="default" group="P" index="14"/>
      <signal pad="PA15" function="default" group="P" index="15"/>
      <signal pad="PA16" function="default" group="P" index="16"/>
      <signal pad="PA17" function="default" group="P" index="17"/>
      <signal pad="PA18" function="default" group="P" index="18"/>
      <signal pad="PA19" function="default" group="P" index="19"/>
      <signal pad="PA20" function="default" group="P" index="20"/>
      <signal pad="PA21" function="default" group="P" index="21"/>
      <signal pad="PA22" function="default" group="P" index="22"/>
      <signal pad="PA23" function="default" group="P" index="23"/>
      <signal pad="PA24" function="default" group="P" index="24"/>
      <signal pad="PA25" function="default" group="P" index="25"/>
      <signal pad="PA26" function="default" group="P" index="26"/>
      <signal pad="PA27" function="default" group="P" index="27"/>
      <signal pad="PA28" function="default" group="P" index="28"/>
      <signal pad="PA29" function="default" group="P" index="29"/>
      <signal pad="PA30" function="default" group="P" index="30"/>
      <signal pad="PA31" function="default" group="P" index="31"/>
      <signal pad="PA23" function="X1" group="PIODCCLK"/>
      <signal pad="PA24" function="X1" group="PIODC" index="0"/>
      <signal pad="PA25" function="X1" group="PIODC" index="1"/>
      <signal pad="PA26" function="X1" group="PIODC" index="2"/>
      <signal pad="PA27" function="X1" group="PIODC" index="3"/>
      <signal pad="PA28" function="X1" group="PIODC" index="4"/>
      <signal pad="PA29" function="X1" group="PIODC" index="5"/>
      <signal pad="PA31" function="X1" group="PIODC" index="7"/>
      <signal pad="PA30" function="X1" group="WKUP" index="11"/>
      <signal pad="PA30" function="X1" group="PIODC" index="6"/>
      <signal pad="PA15" function="X1" group="WKUP" index="14"/>
      <signal pad="PA15" function="X1" group="PIODCEN" index="1"/>
      <signal pad="PA16" function="X1" group="WKUP" index="15"/>
      <signal pad="PA16" function="X1" group="PIODCEN" index="2"/>
    </signals>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
          <signals>
      <signal pad="PB0" function="default" group="P" index="32"/>
      <signal pad="PB1" function="default" group="P" index="33"/>
      <signal pad="PB2" function="default" group="P" index="34"/>
      <signal pad="PB3" function="default" group="P" index="35"/>
      <signal pad="PB4" function="default" group="P" index="36"/>
      <signal pad="PB5" function="default" group="P" index="37"/>
      <signal pad="PB6" function="default" group="P" index="38"/>
      <signal pad="PB7" function="default" group="P" index="39"/>
      <signal pad="PB8" function="default" group="P" index="40"/>
      <signal pad="PB9" function="default" group="P" index="41"/>
      <signal pad="PB10" function="default" group="P" index="42"/>
      <signal pad="PB11" function="default" group="P" index="43"/>
      <signal pad="PB12" function="default" group="P" index="44"/>
      <signal pad="PB13" function="default" group="P" index="45"/>
      <signal pad="PB14" function="default" group="P" index="46"/>
    </signals>
          </instance>
