Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4ecb/atdf/ATSAM4E8CB.atdf
          <instance name="PIOC">
            <register-group address-space="base" name="PIOC" name-in-module="PIO" offset="0x400E1200"/>
          <signals>
      <signal pad="PC0" function="default" group="P" index="64"/>
      <signal pad="PC1" function="default" group="P" index="65"/>
      <signal pad="PC2" function="default" group="P" index="66"/>
      <signal pad="PC3" function="default" group="P" index="67"/>
      <signal pad="PC4" function="default" group="P" index="68"/>
      <signal pad="PC5" function="default" group="P" index="69"/>
      <signal pad="PC6" function="default" group="P" index="70"/>
      <signal pad="PC7" function="default" group="P" index="71"/>
      <signal pad="PC8" function="default" group="P" index="72"/>
      <signal pad="PC9" function="default" group="P" index="73"/>
      <signal pad="PC10" function="default" group="P" index="74"/>
      <signal pad="PC11" function="default" group="P" index="75"/>
      <signal pad="PC12" function="default" group="P" index="76"/>
      <signal pad="PC13" function="default" group="P" index="77"/>
      <signal pad="PC14" function="default" group="P" index="78"/>
      <signal pad="PC15" function="default" group="P" index="79"/>
      <signal pad="PC16" function="default" group="P" index="80"/>
      <signal pad="PC17" function="default" group="P" index="81"/>
      <signal pad="PC18" function="default" group="P" index="82"/>
      <signal pad="PC19" function="default" group="P" index="83"/>
      <signal pad="PC20" function="default" group="P" index="84"/>
      <signal pad="PC21" function="default" group="P" index="85"/>
      <signal pad="PC22" function="default" group="P" index="86"/>
      <signal pad="PC23" function="default" group="P" index="87"/>
      <signal pad="PC24" function="default" group="P" index="88"/>
      <signal pad="PC25" function="default" group="P" index="89"/>
      <signal pad="PC26" function="default" group="P" index="90"/>
      <signal pad="PC27" function="default" group="P" index="91"/>
      <signal pad="PC28" function="default" group="P" index="92"/>
      <signal pad="PC29" function="default" group="P" index="93"/>
      <signal pad="PC30" function="default" group="P" index="94"/>
      <signal pad="PC31" function="default" group="P" index="95"/>
    </signals>
          </instance>
        </module>
        <module name="PMC" id="11116" version="N">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0400"/>
            
          <signals>
              <signal pad="PA6" function="B" group="PCK" index="0"/>
              <signal pad="PB13" function="B" group="PCK" index="0"/>
              <signal pad="PA17" function="B" group="PCK" index="1"/>
              <signal pad="PA21" function="B" group="PCK" index="1"/>
              <signal pad="PA18" function="B" group="PCK" index="2"/>
              <signal pad="PA31" function="B" group="PCK" index="2"/>
              <signal pad="PB3" function="B" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" id="6343" version="N">
          <instance name="PWM">
            <register-group address-space="base" name="PWM" name-in-module="PWM" offset="0x40000000"/>
            
          <signals>
              <signal pad="PA9" function="C" group="PWMFI" index="0"/>
              <signal pad="PA0" function="A" group="PWMH" index="0"/>
              <signal pad="PA11" function="B" group="PWMH" index="0"/>
              <signal pad="PA23" function="B" group="PWMH" index="0"/>
              <signal pad="PB0" function="A" group="PWMH" index="0"/>
              <signal pad="PC18" function="B" group="PWMH" index="0"/>
              <signal pad="PD20" function="A" group="PWMH" index="0"/>
              <signal pad="PA1" function="A" group="PWMH" index="1"/>
              <signal pad="PA12" function="B" group="PWMH" index="1"/>
              <signal pad="PA24" function="B" group="PWMH" index="1"/>
              <signal pad="PB1" function="A" group="PWMH" index="1"/>
              <signal pad="PC19" function="B" group="PWMH" index="1"/>
              <signal pad="PD21" function="A" group="PWMH" index="1"/>
              <signal pad="PA2" function="A" group="PWMH" index="2"/>
              <signal pad="PA13" function="B" group="PWMH" index="2"/>
              <signal pad="PA25" function="B" group="PWMH" index="2"/>
              <signal pad="PB4" function="B" group="PWMH" index="2"/>
              <signal pad="PC20" function="B" group="PWMH" index="2"/>
              <signal pad="PD22" function="A" group="PWMH" index="2"/>
              <signal pad="PA7" function="B" group="PWMH" index="3"/>
              <signal pad="PA14" function="B" group="PWMH" index="3"/>
              <signal pad="PA17" function="C" group="PWMH" index="3"/>
              <signal pad="PB14" function="B" group="PWMH" index="3"/>
              <signal pad="PC21" function="B" group="PWMH" index="3"/>
              <signal pad="PD23" function="A" group="PWMH" index="3"/>
              <signal pad="PA19" function="B" group="PWML" index="0"/>
              <signal pad="PB5" function="B" group="PWML" index="0"/>
              <signal pad="PC0" function="B" group="PWML" index="0"/>
              <signal pad="PC13" function="B" group="PWML" index="0"/>
              <signal pad="PD24" function="A" group="PWML" index="0"/>
              <signal pad="PA20" function="B" group="PWML" index="1"/>
              <signal pad="PB12" function="A" group="PWML" index="1"/>
              <signal pad="PC1" function="B" group="PWML" index="1"/>
              <signal pad="PC15" function="B" group="PWML" index="1"/>
              <signal pad="PD25" function="A" group="PWML" index="1"/>
              <signal pad="PA16" function="C" group="PWML" index="2"/>
              <signal pad="PA30" function="A" group="PWML" index="2"/>
              <signal pad="PB13" function="A" group="PWML" index="2"/>
              <signal pad="PC2" function="B" group="PWML" index="2"/>
              <signal pad="PD26" function="A" group="PWML" index="2"/>
              <signal pad="PA15" function="C" group="PWML" index="3"/>
              <signal pad="PC3" function="B" group="PWML" index="3"/>
              <signal pad="PC22" function="B" group="PWML" index="3"/>
              <signal pad="PD27" function="A" group="PWML" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" id="11009" version="F">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1800"/>
