Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4ecb/atdf/ATSAM4E8CB.atdf
        <module name="UDP" id="6083" version="X">
          <instance name="UDP">
            <register-group address-space="base" name="UDP" name-in-module="UDP" offset="0x40084000"/>
          </instance>
        </module>
        <module name="USART" id="6089" version="ZG">
          <instance name="USART0">
            <register-group address-space="base" name="USART0" name-in-module="USART" offset="0x400A0000"/>
            
          <signals>
              <signal pad="PB2" function="C" group="CTS" index="0"/>
              <signal pad="PB3" function="C" group="RTS" index="0"/>
              <signal pad="PB0" function="C" group="RXD" index="0"/>
              <signal pad="PB13" function="C" group="SCK" index="0"/>
              <signal pad="PB1" function="C" group="TXD" index="0"/>
            </signals>
          </instance>
          <instance name="USART1">
            <register-group address-space="base" name="USART1" name-in-module="USART" offset="0x400A4000"/>
            
          <signals>
              <signal pad="PA25" function="A" group="CTS" index="1"/>
              <signal pad="PA26" function="A" group="DCD" index="1"/>
              <signal pad="PA28" function="A" group="DSR" index="1"/>
              <signal pad="PA27" function="A" group="DTR" index="1"/>
              <signal pad="PA29" function="A" group="RI" index="1"/>
              <signal pad="PA24" function="A" group="RTS" index="1"/>
              <signal pad="PA21" function="A" group="RXD" index="1"/>
              <signal pad="PA23" function="A" group="SCK" index="1"/>
              <signal pad="PA22" function="A" group="TXD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="WDT" id="6080" version="H">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1850"/>
          </instance>
        </module>
        <module name="FUSES" id="1" version="1">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" id="1" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
      <module name="SystemControl">
            <instance name="SystemControl">
                <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
            </instance>
        </module><module name="SysTick">
            <instance name="SysTick">
                <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
            </instance>
        </module><module name="NVIC">
            <instance name="NVIC">
                <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
            </instance>
        </module><module name="MPU">
            <instance name="MPU">
                <register-group address-space="base" offset="0xE000ED90" name-in-module="MPU" name="MPU"/>
            </instance>
        </module></peripherals>
      <interrupts>
        <interrupt index="-14" name="NonMaskableInt_IRQn" caption="Non Maskable Interrupt"/>
        <interrupt index="-13" name="HardFault_IRQn" caption="HardFault Interrupt"/>
        <interrupt index="-12" name="MemoryManagement_IRQn" caption="Cortex-M4 Memory Management Interrupt"/>
        <interrupt index="-11" name="BusFault_IRQn" caption="Cortex-M4 Bus Fault Interrupt"/>
        <interrupt index="-10" name="UsageFault_IRQn" caption="Cortex-M4 Usage Fault Interrupt"/>
        <interrupt index="-5" name="SVCall_IRQn" caption="Cortex-M4 SV Call Interrupt"/>
        <interrupt index="-4" name="DebugMonitor_IRQn" caption="Cortex-M4 Debug Monitor Interrupt"/>
        <interrupt index="-2" name="PendSV_IRQn" caption="Cortex-M4 Pend SV Interrupt"/>
        <interrupt index="-1" name="SysTick_IRQn" caption="Cortex-M4 System Tick Interrupt"/>
        <interrupt index="0" module-instance="SUPC" name="SUPC_IRQn" caption="Supply Controller"/>
        <interrupt index="1" module-instance="RSTC" name="RSTC_IRQn" caption="Reset Controller"/>
        <interrupt index="2" module-instance="RTC" name="RTC_IRQn" caption="Real Time Clock"/>
        <interrupt index="3" module-instance="RTT" name="RTT_IRQn" caption="Real Time Timer"/>
        <interrupt index="4" module-instance="WDT" name="WDT_IRQn" caption="Watchdog/Dual Watchdog Timer"/>
        <interrupt index="5" module-instance="PMC" name="PMC_IRQn" caption="Power Management Controller"/>
        <interrupt index="6" module-instance="EFC" name="EFC_IRQn" caption="Enhanced Embedded Flash Controller"/>
        <interrupt index="7" module-instance="UART0" name="UART0_IRQn" caption="UART 0"/>
        <interrupt index="9" module-instance="PIOA" name="PIOA_IRQn" caption="Parallel I/O Controller A"/>
        <interrupt index="10" module-instance="PIOB" name="PIOB_IRQn" caption="Parallel I/O Controller B"/>
        <interrupt index="11" module-instance="PIOC" name="PIOC_IRQn" caption="Parallel I/O Controller C"/>
        <interrupt index="14" module-instance="USART0" name="USART0_IRQn" caption="USART 0"/>
        <interrupt index="15" module-instance="USART1" name="USART1_IRQn" caption="USART 1"/>
        <interrupt index="16" module-instance="HSMCI" name="HSMCI_IRQn" caption="Multimedia Card Interface"/>
        <interrupt index="17" module-instance="TWI0" name="TWI0_IRQn" caption="Two Wire Interface 0"/>
        <interrupt index="18" module-instance="TWI1" name="TWI1_IRQn" caption="Two Wire Interface 1"/>
        <interrupt index="19" module-instance="SPI" name="SPI_IRQn" caption="Serial Peripheral Interface"/>
        <interrupt index="20" module-instance="DMAC" name="DMAC_IRQn" caption="DMAC"/>
        <interrupt index="21" module-instance="TC0" name="TC0_IRQn" caption="Timer/Counter 0"/>
        <interrupt index="22" module-instance="TC0" name="TC1_IRQn" caption="Timer/Counter 1"/>
        <interrupt index="23" module-instance="TC0" name="TC2_IRQn" caption="Timer/Counter 2"/>
        <interrupt index="24" module-instance="TC1" name="TC3_IRQn" caption="Timer/Counter 3"/>
        <interrupt index="25" module-instance="TC1" name="TC4_IRQn" caption="Timer/Counter 4"/>
        <interrupt index="26" module-instance="TC1" name="TC5_IRQn" caption="Timer/Counter 5"/>
        <interrupt index="27" module-instance="TC2" name="TC6_IRQn" caption="Timer/Counter 6"/>
        <interrupt index="28" module-instance="TC2" name="TC7_IRQn" caption="Timer/Counter 7"/>
        <interrupt index="29" module-instance="TC2" name="TC8_IRQn" caption="Timer/Counter 8"/>
        <interrupt index="30" module-instance="AFEC0" name="AFEC0_IRQn" caption="Analog Front End 0"/>
        <interrupt index="31" module-instance="AFEC1" name="AFEC1_IRQn" caption="Analog Front End 1"/>
        <interrupt index="32" module-instance="DACC" name="DACC_IRQn" caption="Digital To Analog Converter"/>
        <interrupt index="33" module-instance="ACC" name="ACC_IRQn" caption="Analog Comparator"/>
        <interrupt index="35" module-instance="UDP" name="UDP_IRQn" caption="USB DEVICE"/>
        <interrupt index="36" module-instance="PWM" name="PWM_IRQn" caption="PWM"/>
        <interrupt index="37" module-instance="CAN0" name="CAN0_IRQn" caption="CAN0"/>
        <interrupt index="38" module-instance="CAN1" name="CAN1_IRQn" caption="CAN1"/>
        <interrupt index="39" module-instance="AES" name="AES_IRQn" caption="AES"/>
        <interrupt index="45" module-instance="UART1" name="UART1_IRQn" caption="UART"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B3703F"/>
          <property name="CHIPID_CIDR" value="0xA3CC0CE1"/>
          <property name="CHIPID_EXID" value="0x00110308"/>
        </property-group>
      </property-groups>
      <parameters>
        <param name="__CM4_REV" value="0x0001"/>
        <param name="__MPU_PRESENT" value="1"/>
        <param name="__FPU_PRESENT" value="1"/>
        <param name="__NVIC_PRIO_BITS" value="4"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
      </parameters>
    </device>
  </devices>
  <modules>
    <module name="ACC" caption="Analog Comparator Controller" id="6490" version="E">
      <register-group name="ACC"><register caption="Control Register" name="ACC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="ACC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Selection for Minus Comparator Input" mask="0x00000007" name="SELMINUS" values="ACC_MR__SELMINUS"/>
          <bitfield caption="Selection For Plus Comparator Input" mask="0x00000070" name="SELPLUS" values="ACC_MR__SELPLUS"/>
          <bitfield caption="Analog Comparator Enable" mask="0x00000100" name="ACEN" values="ACC_MR__ACEN"/>
          <bitfield caption="Edge Type" mask="0x00000600" name="EDGETYP" values="ACC_MR__EDGETYP"/>
          <bitfield caption="Invert Comparator Output" mask="0x00001000" name="INV" values="ACC_MR__INV"/>
          <bitfield caption="Selection Of Fault Source" mask="0x00002000" name="SELFS" values="ACC_MR__SELFS"/>
          <bitfield caption="Fault Enable" mask="0x00004000" name="FE" values="ACC_MR__FE"/>
        </register>
        <register caption="Interrupt Enable Register" name="ACC_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
        <register caption="Interrupt Disable Register" name="ACC_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
