Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4ecb/atdf/ATSAM4E8CB.atdf
        <register caption="I/O Delay Register" name="PIO_DELAYR" offset="0x0110" rw="RW" size="4">
          <bitfield caption="Delay Control for Simultaneous Switch Reduction" mask="0x0000000F" name="Delay0"/>
          <bitfield caption="Delay Control for Simultaneous Switch Reduction" mask="0x000000F0" name="Delay1"/>
          <bitfield caption="Delay Control for Simultaneous Switch Reduction" mask="0x00000F00" name="Delay2"/>
          <bitfield caption="Delay Control for Simultaneous Switch Reduction" mask="0x0000F000" name="Delay3"/>
          <bitfield caption="Delay Control for Simultaneous Switch Reduction" mask="0x000F0000" name="Delay4"/>
          <bitfield caption="Delay Control for Simultaneous Switch Reduction" mask="0x00F00000" name="Delay5"/>
          <bitfield caption="Delay Control for Simultaneous Switch Reduction" mask="0x0F000000" name="Delay6"/>
          <bitfield caption="Delay Control for Simultaneous Switch Reduction" mask="0xF0000000" name="Delay7"/>
        </register>
        <register caption="Parallel Capture Mode Register" name="PIO_PCMR" offset="0x150" rw="RW" size="4">
          <bitfield caption="Parallel Capture Mode Enable" mask="0x00000001" name="PCEN"/>
          <bitfield caption="Parallel Capture Mode Data Size" mask="0x00000030" name="DSIZE" values="PIO_PCMR__DSIZE"/>
          <bitfield caption="Parallel Capture Mode Always Sampling" mask="0x00000200" name="ALWYS"/>
          <bitfield caption="Parallel Capture Mode Half Sampling" mask="0x00000400" name="HALFS"/>
          <bitfield caption="Parallel Capture Mode First Sample" mask="0x00000800" name="FRSTS"/>
        </register>
        <register caption="Parallel Capture Interrupt Enable Register" name="PIO_PCIER" offset="0x154" rw="W" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready Interrupt Enable" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Enable" mask="0x00000002" name="OVRE"/>
          <bitfield caption="End of Reception Transfer Interrupt Enable" mask="0x00000004" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full Interrupt Enable" mask="0x00000008" name="RXBUFF"/>
        </register>
        <register caption="Parallel Capture Interrupt Disable Register" name="PIO_PCIDR" offset="0x158" rw="W" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready Interrupt Disable" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Disable" mask="0x00000002" name="OVRE"/>
          <bitfield caption="End of Reception Transfer Interrupt Disable" mask="0x00000004" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full Interrupt Disable" mask="0x00000008" name="RXBUFF"/>
        </register>
        <register caption="Parallel Capture Interrupt Mask Register" name="PIO_PCIMR" offset="0x15C" rw="R" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready Interrupt Mask" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Mask" mask="0x00000002" name="OVRE"/>
          <bitfield caption="End of Reception Transfer Interrupt Mask" mask="0x00000004" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full Interrupt Mask" mask="0x00000008" name="RXBUFF"/>
        </register>
        <register caption="Parallel Capture Interrupt Status Register" name="PIO_PCISR" offset="0x160" rw="R" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error." mask="0x00000002" name="OVRE"/>
          <bitfield caption="End of Reception Transfer." mask="0x00000004" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full" mask="0x00000008" name="RXBUFF"/>
        </register>
        <register caption="Parallel Capture Reception Holding Register" name="PIO_PCRHR" offset="0x164" rw="R" size="4">
          <bitfield caption="Parallel Capture Mode Reception Data." mask="0xFFFFFFFF" name="RDATA"/>
        </register>
        <register caption="Receive Pointer Register" name="PIO_RPR" offset="0x168" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="PIO_RCR" offset="0x16C" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="PIO_RNPR" offset="0x178" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="PIO_RNCR" offset="0x17C" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="PIO_PTCR" offset="0x188" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="PIO_PTSR" offset="0x18C" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
        </register-group>
      <value-group caption="" name="PIO_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x50494F"/>
      </value-group>
