Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4ecb/atdf/ATSAM4E8CB.atdf
    <module name="RSTC" caption="Reset Controller" id="11009" version="F">
      <register-group name="RSTC"><register caption="Control Register" name="RSTC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Processor Reset" mask="0x00000001" name="PROCRST"/>
          <bitfield caption="Peripheral Reset" mask="0x00000004" name="PERRST"/>
          <bitfield caption="External Reset" mask="0x00000008" name="EXTRST"/>
          <bitfield caption="System Reset Key" mask="0xFF000000" name="KEY" values="RSTC_CR__KEY"/>
        </register>
        <register caption="Status Register" name="RSTC_SR" offset="0x04" rw="R" size="4">
          <bitfield caption="User Reset Status" mask="0x00000001" name="URSTS"/>
          <bitfield caption="Reset Type" mask="0x00000700" name="RSTTYP" values="RSTC_SR__RSTTYP"/>
          <bitfield caption="NRST Pin Level" mask="0x00010000" name="NRSTL"/>
          <bitfield caption="Software Reset Command in Progress" mask="0x00020000" name="SRCMP"/>
        </register>
        <register caption="Mode Register" name="RSTC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="User Reset Enable" mask="0x00000001" name="URSTEN"/>
          <bitfield caption="User Reset Interrupt Enable" mask="0x00000010" name="URSTIEN"/>
          <bitfield caption="External Reset Length" mask="0x00000F00" name="ERSTL"/>
          <bitfield caption="Write Access Password" mask="0xFF000000" name="KEY" values="RSTC_MR__KEY"/>
        </register>
        </register-group>
      <value-group caption="" name="RSTC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="RSTC_SR__RSTTYP">
        <value caption="First power-up reset" name="GENERAL_RST" value="0x0"/>
        <value caption="Return from Backup Mode" name="BACKUP_RST" value="0x1"/>
        <value caption="Watchdog fault occurred" name="WDT_RST" value="0x2"/>
        <value caption="Processor reset required by the software" name="SOFT_RST" value="0x3"/>
        <value caption="NRST pin detected low" name="USER_RST" value="0x4"/>
      </value-group>
      <value-group caption="" name="RSTC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0xA5"/>
      </value-group>
    </module>
    <module name="RSWDT" caption="Reinforced Safety Watchdog Timer" id="11110" version="B">
      <register-group name="RSWDT"><register caption="Control Register" name="RSWDT_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Watchdog Restart" mask="0x00000001" name="WDRSTT"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="RSWDT_CR__KEY"/>
        </register>
        <register caption="Mode Register" name="RSWDT_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Watchdog Counter Value" mask="0x00000FFF" name="WDV"/>
          <bitfield caption="Watchdog Fault Interrupt Enable" mask="0x00001000" name="WDFIEN"/>
          <bitfield caption="Watchdog Reset Enable" mask="0x00002000" name="WDRSTEN"/>
          <bitfield caption="Watchdog Reset Processor" mask="0x00004000" name="WDRPROC"/>
          <bitfield caption="Watchdog Disable" mask="0x00008000" name="WDDIS"/>
          <bitfield caption="Watchdog Delta Value" mask="0x0FFF0000" name="WDD"/>
          <bitfield caption="Watchdog Debug Halt" mask="0x10000000" name="WDDBGHLT"/>
          <bitfield caption="Watchdog Idle Halt" mask="0x20000000" name="WDIDLEHLT"/>
        </register>
        <register caption="Status Register" name="RSWDT_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="Watchdog Underflow" mask="0x00000001" name="WDUNF"/>
          <bitfield caption="Watchdog Error" mask="0x00000002" name="WDERR"/>
        </register>
        </register-group>
      <value-group caption="" name="RSWDT_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xC4"/>
      </value-group>
    </module>
    <module name="RTC" caption="Real-time Clock" id="6056" version="Q">
      <register-group name="RTC"><register caption="Control Register" name="RTC_CR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Update Request Time Register" mask="0x00000001" name="UPDTIM"/>
          <bitfield caption="Update Request Calendar Register" mask="0x00000002" name="UPDCAL"/>
          <bitfield caption="Time Event Selection" mask="0x00000300" name="TIMEVSEL" values="RTC_CR__TIMEVSEL"/>
          <bitfield caption="Calendar Event Selection" mask="0x00030000" name="CALEVSEL" values="RTC_CR__CALEVSEL"/>
        </register>
        <register caption="Mode Register" name="RTC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="12-/24-hour Mode" mask="0x00000001" name="HRMOD"/>
          <bitfield caption="PERSIAN Calendar" mask="0x00000002" name="PERSIAN"/>
          <bitfield caption="NEGative PPM Correction" mask="0x00000010" name="NEGPPM"/>
          <bitfield caption="Slow Clock Correction" mask="0x00007F00" name="CORRECTION"/>
          <bitfield caption="HIGH PPM Correction" mask="0x00008000" name="HIGHPPM"/>
          <bitfield caption="RTCOUT0 OutputSource Selection" mask="0x00070000" name="OUT0" values="RTC_MR__OUT0"/>
          <bitfield caption="RTCOUT1 Output Source Selection" mask="0x00700000" name="OUT1" values="RTC_MR__OUT1"/>
          <bitfield caption="High Duration of the Output Pulse" mask="0x07000000" name="THIGH" values="RTC_MR__THIGH"/>
          <bitfield caption="Period of the Output Pulse" mask="0x30000000" name="TPERIOD" values="RTC_MR__TPERIOD"/>
        </register>
        <register caption="Time Register" name="RTC_TIMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Current Second" mask="0x0000007F" name="SEC"/>
          <bitfield caption="Current Minute" mask="0x00007F00" name="MIN"/>
          <bitfield caption="Current Hour" mask="0x003F0000" name="HOUR"/>
          <bitfield caption="Ante Meridiem Post Meridiem Indicator" mask="0x00400000" name="AMPM"/>
        </register>
